/******************************************************************************
 *
 * 文件名  ： CLibLeastSquare.c
 * 创建日期： 20190705 
 * 版本号  ： v1.0
 * 文件描述： 最小二乘法 实现
 * 其    他： 无
 * 修改日志： 无
 *
  *******************************************************************************/


/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include "CLibLeastSquare.h"

#include <math.h>

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/


/********************************** 函数声明区 *********************************/


/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
void CLibLeastSquare(const f64 *x, const f64 *y, size_t size, f64 *a, f64 *b, f64 *sqSum)
{
    size_t i = 0;
    f64 aVal = 0;       /* 斜率 */
    f64 bVal = 0;       /* 截距 */
    f64 sqSumVal = 0;   /* 误差平方和 */

    f64 xSum = 0;       /* x 和 */
    f64 ySum = 0;       /* y 和 */
    f64 xxSum = 0;      /* x 平方和 */
    f64 yySum = 0;      /* y 平方和 */
    f64 xySum = 0;      /* xy乘积和 */
    f64 xAvg = 0;       /* x 均值 */
    f64 yAvg = 0;       /* y 均值 */
    
    f64 yEst = 0;       /* y的估计值 */
    
    /* step1: 计算准备 */
    for(i = 0; i < size; i++)
    {
        xSum += x[i];
        ySum += y[i];
    
        xxSum += (x[i] * x[i]);
        yySum += (y[i] * y[i]);
        xySum += (x[i] * y[i]);
    }
    xAvg = xSum / size;
    yAvg = ySum / size;
    
    /* step2: 求系数 */
    aVal = (xySum - yAvg * xSum) / (xxSum - xAvg * xSum);
    bVal = yAvg - (aVal) * xAvg;
    
    /* step3: 求误差 */
    for(i = 0; i < size; i++)
    {
        yEst = aVal * x[i] + bVal;
        sqSumVal += (yEst - y[i]) * (yEst - y[i]);
    }
    
    /* 误差归一化 */
    sqSumVal /= size;
    sqSumVal = sqrt(sqSumVal);
    sqSumVal /= yAvg;           /* 使用y的均值 归一化误差 */
    sqSumVal = fabs(sqSumVal);
    
    *a = aVal;
    *b = bVal;
    *sqSum = sqSumVal;
}
