/******************************************************************************
 *
 * 文件名  ： CLibEndian.h
 * 创建日期： 20191025 
 * 版本号  ： v1.0
 * 文件描述： 大小端转换算法
 * 其    他： 无
 * 修改日志： 无
 *
  *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifdef __cplusplus
extern "C"
{
#endif

#ifndef _CLIB_ENDIAN_H_
#define _CLIB_ENDIAN_H_

/************************************ 头文件 ***********************************/
#include "TypeDef.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/* 主机序       => 网络序 */
void CLibHton(u8 *dest, const u8 *src, size_t len);
/* 网络序       => 主机序 */
void CLibNtoh(u8 *dest, const u8 *src, size_t len);

/* 主机序       => 大端 */
void CLibHtob(u8 *dest, const u8 *src, size_t len);
/* 大端         => 主机序 */
void CLibBtoh(u8 *dest, const u8 *src, size_t len);
/* 主机序       => 小端 */
void CLibHtol(u8 *dest, const u8 *src, size_t len);
/* 小端         => 主机序 */
void CLibLtoh(u8 *dest, const u8 *src, size_t len);


#endif // #ifndef _CLIB_ENDIAN_H_

#ifdef __cplusplus
}
#endif
