/******************************************************************************
 *
 * 文件名  ： PssCppLog.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20220112
 * 版本号  ： v1.0 20220112
 * 文件描述： Pss Cpp的Log模块 头文件
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _PSS_CPP_LOG_H_
#define _PSS_CPP_LOG_H_

/************************************ 头文件 ***********************************/
#include "PssCLibLog.h"

/*********************************** 命名空间 **********************************/

/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */
/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class PssCppLog
{
public:
    ~PssCppLog(void);                                                                                   /* 析构 */
    static PSS_CLIB_LOG_T *GetCLibLog(void);                                                            /* 获取单例 */
    static void SetStdout(bool enable);                                                                 /* 使能Log输出到标准输出 */
    static void SetLogFile(const char *logFilePath);                                                    /* 使能Log输出到文件 */

protected:

private:
    explicit PssCppLog(void);                                                                           /* 构造 */
    static PssCppLog *mSingleton;                                                                       /* 单例 */
    PSS_CLIB_LOG_T   *mLog;                                                                             /* CLIB的Log模块 */
};

#endif // _PSS_LOG_H_

