/******************************************************************************
 *
 * 文件名  ： PssIIo.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20220110
 * 版本号  ： v1.0 20220110
 * 文件描述： Pss IO 接口(抽象)类 头文件
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _PSS_I_IO_H_
#define _PSS_I_IO_H_

/************************************ 头文件 ***********************************/
#include "PssTypeDef.h"

/*********************************** 命名空间 **********************************/

/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */
/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class PssIIo
{
public:
    typedef enum _Mode_Tag_ {
        Block      = 0,
        NonBlock   = 1,
    } Mode;

    virtual ~PssIIo(void) = 0;                                                                          /* 接口类 纯虚析构 */

    virtual i32 Open(Mode mode) = 0;                                                                    /* 打开 */
    virtual i32 Close(void) = 0;                                                                        /* 关闭 */
    virtual bool IsOpenned(void) const = 0;                                                             /* 是否已打开? */
    virtual i32 Send(const char *buf, i32 size) = 0;                                                    /* 发送 */
    virtual i32 Recv(      char *buf, i32 size) = 0;                                                    /* 接收 */
    virtual i32 FlushOut(void) = 0;                                                                     /* 刷新发送缓冲 */
    virtual i32 ClearIn(void) = 0;                                                                      /* 清空接收缓冲 */

protected:
    explicit PssIIo(void);                                                                              /* 构造 */

private:

};

#endif // _PSS_I_IO_H_

