/******************************************************************************
 *
 * 文件名  ： DbgInQt.h
 * 创建日期： 20200223
 * 版本号  ： v1.0 20200223
 * 文件描述： 调试接口
 * 其    他： 无
 * 修改日志： 无
 *
  *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _I_TOOL_H_
#define _I_TOOL_H_

/************************************ 头文件 ***********************************/
#include "TypeDef.h"
#include "RstDef.h"
#include <QString>

/*********************************** 命名空间 **********************************/

/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */
/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class IQStringAble
{
    public:
        virtual ~IQStringAble(void);

        /* 仅在Qt上可用 */
        /* 接口定义 */
        virtual QString ToQString(void) const = 0;                                                      /* 转为字符串 */

    protected:
                        IQStringAble(void);                                                             /* 构造函数,抽象类,不可实例化 */

};

/*********************************** 工具函数 **********************************/

/* 延迟ms毫秒 */
void DelayMs(int32_t ms);
/* 获取系统启动的时间 */
int32_t GetNowMs(void);

/* 返回值 [begin, end) */
int GetRandomInRange(int begin, int end);

/* 随机延迟[min, max)ms */
void DelayRadomMs(int min, int max);



#define PSS_UNUSED(x) (void)x;

#endif // _I_TOOL_H_
