/******************************************************************************
 *
 * 文件名  ： Qt2450.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20200326
 * 版本号  ： v1.0 20200326
 * 文件描述： 2450 代理类
 * 其    他： 无
 * 修改日志： 无
 *
  *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _PSS_QT_2450_H_
#define _PSS_QT_2450_H_

/************************************ 头文件 ***********************************/
#include "QtIInstrument.h"
#include "Sx00ScpiClient.h"
#include "Sx00Instrument.h"
#include <QHostAddress>

/*********************************** 命名空间 **********************************/
namespace Pss {
namespace Qt {

/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */

/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class Qt2450 : public Sx00Instrument
{
    Q_OBJECT
    public:
        /* 使用网口 */
        Qt2450(const QHostAddress &ip, QObject *parent = 0);
        ~Qt2450(void);
        static QString GetIdName(void);                                                                 /* 获取2450的IDN标识 */

    private:
        int GetMeasureVal(PssInstrumentMeasureType type, double& val, uint32_t timeout = 1000);/* 获取测量值 */
        int UpdateCfgToInstrument(void) override;                                /* 源信息设置 */
        static const char *mcName;                                                                      /* IDN中的设备标识 */
        bool mIsMeasI;                                                                                  /* 本次测试电流 */

};
/*********************************** 工具函数 **********************************/

}
}

#endif // _PSS_QT_2450_H_