/******************************************************************************
 *
 * 文件名  ： Qt34470A.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20200326
 * 版本号  ： v1.0 20200326
 * 文件描述： 2450 代理类
 * 其    他： 无
 * 修改日志： 无
 *
  *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _PSS_QT_34470A_H_
#define _PSS_QT_34470A_H_

/************************************ 头文件 ***********************************/
#include "QtIInstrument.h"
#include "Sx00Instrument.h"

/*********************************** 命名空间 **********************************/


/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */

/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class Qt34470A : public Sx00Instrument
{
    Q_OBJECT
    public:
        /* 使用网口 */
        Qt34470A(const QHostAddress &ip, QObject *parent = 0);
        ~Qt34470A(void);

        static QString GetIdName(void);                                                                 /* 获取34470A的IDN标识 */
    
    private:
        virtual int UpdateCfgToInstrument(void) override;                                               /* 配置信息 设置 到仪表 */
        static const char *mcName;                                                                      /* IDN中的设备标识 */
};
/*********************************** 工具函数 **********************************/



#endif // _PSS_QT_2450_H_
