/******************************************************************************
 *
 * 文件名  ： PssDeviceFactory.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20220112
 * 版本号  ： v1.0 20220112
 * 文件描述： Pss 设备简单工厂类 头文件
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _PSS_DEVICE_FACTORY_H_
#define _PSS_DEVICE_FACTORY_H_

/************************************ 头文件 ***********************************/
#include "PssTypeDef.h"

/*********************************** 命名空间 **********************************/

/*********************************** 注释定位 **********************************/
                                                                                                        /* 注释定位 */
/*********************************** 枚举定义 **********************************/

/************************************ 类定义 ***********************************/
class PssIIo;
class PssIDevice;
class PssDeviceFactory
{
public:
    ~PssDeviceFactory(void);                                                                            /* 析构 */
    static PssIDevice *CreatePssDevice(PssIIo *iio);                                                    /* 简单工厂 */

private:
    explicit PssDeviceFactory(void);                                                                    /* 构造 */
};

#endif // _PSS_DEVICE_FACTORY_H_

