/******************************************************************************
 *
 * 文件名  ： PssCLibEndian.h
 * 负责人  ： 彭鹏(516190948@qq.com)
 * 创建日期： 20191025 
 * 版本号  ： v1.0
 * 文件描述： Pss 大小端转换算法
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/

/*---------------------------------- 预处理区 ---------------------------------*/
#ifdef __cplusplus
extern "C"
{
#endif

#ifndef _PSS_CLIB_ENDIAN_H_
#define _PSS_CLIB_ENDIAN_H_

/************************************ 头文件 ***********************************/
#include "PssTypeDef.h"

/************************************ 宏定义 ***********************************/

/*********************************** 类型定义 **********************************/

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/* 主机序       => 网络序 */
void PssCLibHton(void *dest, const void *src, u32 len);
/* 网络序       => 主机序 */
void PssCLibNtoh(void *dest, const void *src, u32 len);

/* 主机序       => 大端 */
void PssCLibHtob(void *dest, const void *src, u32 len);
/* 大端         => 主机序 */
void PssCLibBtoh(void *dest, const void *src, u32 len);
/* 主机序       => 小端 */
void PssCLibHtol(void *dest, const void *src, u32 len);
/* 小端         => 主机序 */
void PssCLibLtoh(void *dest, const void *src, u32 len);


#endif // #ifndef _PSS_CLIB_ENDIAN_H_

#ifdef __cplusplus
}
#endif

